import unittest
import os
import sys

sys.path.append('..')
import PdfPayTable




class TestPdfPayTable(unittest.TestCase):

    def setUp(self):
        # self.root = os.getcwd()
        pass

    def tearDown(self):
        #os.chdir(self.root)
        pass

    def test_convert_pdf_to_html(self):
        pdfpaytable = PdfPayTable.PdfPayTable('input')
        filename = "normal_pay_table"

        file_content = pdfpaytable.convert_pdf_to_html(filename)

        self.assertTrue('张家界旅游集团股份有限公司' in file_content.decode('utf-8'))


    def test_read_file_normal(self):
        pdfpaytable = PdfPayTable.PdfPayTable('input')

        file_content = normal_file_content.encode('utf-8')

        payextractor = pdfpaytable.read_file(file_content)
        self.assertEqual(128, len(payextractor.text_list))
        self.assertTrue(isinstance(payextractor, PdfPayTable.PayTableExtractorNormal))


    def test_read_file_share(self):
        pdfpaytable = PdfPayTable.PdfPayTable('input')

        file_content = share_file_content.encode('utf-8')

        payextractor = pdfpaytable.read_file(file_content)

        self.assertEqual(203, len(payextractor.text_list))
        self.assertTrue(isinstance(payextractor, PdfPayTable.PayTableExtractorShare))

    def test_extract_pay_list_share(self):
        pdfpaytable = PdfPayTable.PdfPayTable('input')
        file_content = share_file_content.encode('utf-8')
        payextractor = pdfpaytable.read_file(file_content)

        pay_list = payextractor.get_pay_table()
        print(len(pay_list))


    def test_extract_pay_list_normal(self):
        pdfpaytable = PdfPayTable.PdfPayTable('input')
        file_content = normal_file_content.encode('utf-8')
        payextractor = pdfpaytable.read_file(file_content)

        pay_list = payextractor.get_pay_table()
        self.assertEqual(21, len(pay_list))
        self.assertIn(['赵文胜', '董事长', '男', '50', '现任', '11.98'], pay_list)
        self.assertIn(['王宏伟', '行政总监', '男', '41', '离任', '5'], pay_list)
        self.assertIn(['金鑫', '副总裁、董事会秘书', '男', '45', '现任', '38.62'], pay_list)

    def test_extract_pay_list_share(self):
        pdfpaytable = PdfPayTable.PdfPayTable('input')
        file_content = share_file_content.encode('utf-8')
        payextractor = pdfpaytable.read_file(file_content)

        pay_list = payextractor.get_pay_table()
        self.assertEqual(18, len(pay_list))
        self.assertIn(['张文生', '董事长', '男', '58', '现任', '0'], pay_list)
        self.assertIn(['张美清', '董事会秘书', '女', '38', '现任', '13.16'], pay_list)
        self.assertIn(['黄平利', '副总经理', '男', '57', '离任', '28.43'], pay_list)


normal_file_content = '''
        公司报告期内董事、监事和高级管理人员报酬情况&#160;<br/>
单位：万元&#160;<br/>
从公司获得的税&#160;是否在公司关联<br/>
姓名&#160;<br/>
职务&#160;<br/>
性别&#160;<br/>
年龄&#160;<br/>
任职状态&#160;<br/>
前报酬总额&#160;<br/>
方获取报酬&#160;<br/>
赵文胜&#160;<br/>
董事长&#160;<br/>
男&#160;<br/>
50&#160;现任&#160;<br/>
11.98&#160;否&#160;<br/>
袁祖荣&#160;<br/>
董事&#160;<br/>
男&#160;<br/>
56&#160;现任&#160;<br/>
62.8&#160;否&#160;<br/>
罗选国&#160;<br/>
董事、总裁&#160;<br/>
男&#160;<br/>
57&#160;现任&#160;<br/>
58.8&#160;否&#160;<br/>
阙道文&#160;<br/>
董事&#160;<br/>
男&#160;<br/>
54&#160;现任&#160;<br/>
0&#160;是&#160;<br/>
王爱民&#160;<br/>
董事&#160;<br/>
男&#160;<br/>
47&#160;现任&#160;<br/>
0&#160;是&#160;<br/>
谢斌&#160;<br/>
董事&#160;<br/>
男&#160;<br/>
45&#160;现任&#160;<br/>
0&#160;是&#160;<br/>
李荻辉&#160;<br/>
独立董事&#160;<br/>
女&#160;<br/>
54&#160;现任&#160;<br/>
6.34&#160;否&#160;<br/>
55&#160;<br/>
<hr/>
<a name=56></a>张家界旅游集团股份有限公司&#160;2016&#160;年年度报告全文&#160;<br/>
田贵君&#160;<br/>
独立董事&#160;<br/>
男&#160;<br/>
64&#160;现任&#160;<br/>
6.34&#160;否&#160;<br/>
姜亚&#160;<br/>
独立董事&#160;<br/>
男&#160;<br/>
56&#160;现任&#160;<br/>
6.34&#160;否&#160;<br/>
万自锋&#160;<br/>
监事会主席&#160;<br/>
男&#160;<br/>
43&#160;现任&#160;<br/>
4.88&#160;否&#160;<br/>
宋彬&#160;<br/>
监事&#160;<br/>
男&#160;<br/>
43&#160;现任&#160;<br/>
0&#160;是&#160;<br/>
汪方&#160;<br/>
职工监事&#160;<br/>
女&#160;<br/>
38&#160;现任&#160;<br/>
26.78&#160;否&#160;<br/>
苏涛&#160;<br/>
副总裁、工会主席&#160;<br/>
男&#160;<br/>
53&#160;现任&#160;<br/>
38.96&#160;否&#160;<br/>
金鑫&#160;<br/>
副总裁、董事会秘书&#160;<br/>
男&#160;<br/>
45&#160;现任&#160;<br/>
38.62&#160;否&#160;<br/>
朱洪武&#160;<br/>
副总裁、运营总监&#160;<br/>
男&#160;<br/>
52&#160;现任&#160;<br/>
38.62&#160;否&#160;<br/>
杨晓曦&#160;<br/>
副总裁&#160;<br/>
男&#160;<br/>
44&#160;现任&#160;<br/>
36.62&#160;否&#160;<br/>
张子鹏&#160;<br/>
工程总监&#160;<br/>
男&#160;<br/>
52&#160;现任&#160;<br/>
35.41&#160;否&#160;<br/>
向秀&#160;<br/>
财务总监&#160;<br/>
女&#160;<br/>
47&#160;现任&#160;<br/>
35.08&#160;否&#160;<br/>
王章利&#160;<br/>
董事&#160;<br/>
男&#160;<br/>
43&#160;离任&#160;<br/>
44.93&#160;否&#160;<br/>
刘世星&#160;<br/>
监事会主席&#160;<br/>
男&#160;<br/>
54&#160;离任&#160;<br/>
52.64&#160;否&#160;<br/>
王宏伟&#160;<br/>
行政总监&#160;<br/>
男&#160;<br/>
41&#160;离任&#160;<br/>
5&#160;否&#160;<br/>
合计&#160;<br/>
--&#160;<br/>
--&#160;<br/>
--&#160;<br/>
--&#160;<br/>
510.14&#160;<br/>
--&#160;<br/>
公司董事、高级管理人员报告期内被授予的股权激励情况&#160;<br/>
□&#160;&#160;适用&#160;&#160;√&#160;&#160;不适用&#160;&#160;&#160;<br/>
五、公司员工情况<b>
        '''

share_file_content = '''
一<b>)&#160;</b>现任及报告期内离任董事、监事和高级管理人员持股变动及报酬情况<b>&#160;<br/></b>√适用&#160;□不适用&#160;&#160;<br/>
单位：股&#160;<br/>
报告期内从<br/>
是否在公司<br/>
性<br/>
任期起始日&#160;任期终止日<br/>
年初持股<br/>
年末持股<br/>
年度内股份<br/>
增减变动<br/>
公司获得的<br/>
姓名&#160;<br/>
职务(注)&#160;<br/>
年龄&#160;<br/>
关联方获取<br/>
别&#160;<br/>
期&#160;<br/>
期&#160;<br/>
数&#160;<br/>
数&#160;<br/>
增减变动量&#160;<br/>
原因&#160;<br/>
税前报酬总<br/>
报酬&#160;<br/>
额（万元）&#160;<br/>
张文生&#160;<br/>
董事长&#160;<br/>
男&#160;<br/>
58&#160;<br/>
2012-12-04&#160;&#160;2017-02-10&#160;<br/>
0&#160;<br/>
0&#160;<br/>
0&#160;&#160;&#160; &#160; &#160;&#160;<br/>
0&#160;<br/>
是&#160;<br/>
张文生&#160;<br/>
董事&#160;<br/>
男&#160;<br/>
58&#160;<br/>
2012-12-04&#160;&#160;2017-02-27&#160;<br/>
0&#160;<br/>
0&#160;<br/>
0&#160;&#160;&#160; &#160; &#160;&#160;<br/>
0&#160;<br/>
是&#160;<br/>
王志盛&#160;<br/>
董事&#160;<br/>
男&#160;<br/>
46&#160;<br/>
2014-04-25&#160;&#160;2018-12-30&#160;<br/>
0&#160;<br/>
0&#160;<br/>
0&#160;&#160;&#160; &#160; &#160;&#160;<br/>
0&#160;<br/>
否&#160;<br/>
王志盛&#160;<br/>
总经理&#160;<br/>
男&#160;<br/>
46&#160;<br/>
2014-04-09&#160;&#160;2017-02-10&#160;<br/>
0&#160;<br/>
0&#160;<br/>
0&#160;&#160;&#160; &#160; &#160;&#160;<br/>
47.10&#160;<br/>
否&#160;<br/>
孟庆启&#160;<br/>
外部董事&#160;<br/>
男&#160;<br/>
64&#160;<br/>
2012-12-04&#160;&#160;2018-12-30&#160;<br/>
0&#160;<br/>
0&#160;<br/>
0&#160;&#160;&#160; &#160; &#160;&#160;<br/>
5&#160;<br/>
否&#160;<br/>
周利国&#160;<br/>
独立董事&#160;<br/>
男&#160;<br/>
58&#160;<br/>
2012-12-04&#160;&#160;2018-12-30&#160;<br/>
0&#160;<br/>
0&#160;<br/>
0&#160;&#160;&#160; &#160; &#160;&#160;<br/>
8&#160;<br/>
否&#160;<br/>
邓兰松&#160;<br/>
独立董事&#160;<br/>
男&#160;<br/>
53&#160;<br/>
2012-12-04&#160;&#160;2018-12-30&#160;<br/>
0&#160;<br/>
0&#160;<br/>
0&#160;&#160;&#160; &#160; &#160;&#160;<br/>
8&#160;<br/>
否&#160;<br/>
张建军&#160;<br/>
监事会主席&#160;&#160;男&#160;<br/>
53&#160;<br/>
2015-12-31&#160;&#160;2018-12-30&#160;<br/>
0&#160;<br/>
0&#160;<br/>
0&#160;&#160;&#160; &#160; &#160;&#160;<br/>
0&#160;<br/>
是&#160;<br/>
张建军&#160;<br/>
监事会&#160;<br/>
男&#160;<br/>
53&#160;<br/>
2005-10-28&#160;&#160;2018-12-30&#160;<br/>
0&#160;<br/>
0&#160;<br/>
0&#160;&#160;&#160; &#160; &#160;&#160;<br/>
0&#160;<br/>
是&#160;<br/>
张志军&#160;<br/>
监事&#160;<br/>
女&#160;<br/>
43&#160;<br/>
2015-12-31&#160;&#160;2018-12-30&#160;<br/>
0&#160;<br/>
0&#160;<br/>
0&#160;&#160;&#160; &#160; &#160;&#160;<br/>
0&#160;<br/>
是&#160;<br/>
徐道珍&#160;<br/>
监事&#160;<br/>
女&#160;<br/>
41&#160;<br/>
2006-06-30&#160;&#160;2018-12-30&#160;<br/>
0&#160;<br/>
0&#160;<br/>
0&#160;&#160;&#160; &#160; &#160;&#160;<br/>
13.87&#160;<br/>
否&#160;<br/>
郑良玉&#160;<br/>
副总经理&#160;<br/>
男&#160;<br/>
52&#160;<br/>
2012-12-04&#160;&#160;2017-02-10&#160;<br/>
0&#160;<br/>
0&#160;<br/>
0&#160;&#160;&#160; &#160; &#160;&#160;<br/>
39.53&#160;<br/>
否&#160;<br/>
侯功海&#160;<br/>
副总经理&#160;<br/>
男&#160;<br/>
51&#160;<br/>
2015-09-25&#160;&#160;2018-12-30&#160;<br/>
0&#160;<br/>
0&#160;<br/>
0&#160;&#160;&#160; &#160; &#160;&#160;<br/>
28.30&#160;<br/>
否&#160;<br/>
王成&#160;<br/>
副总经理&#160;<br/>
男&#160;<br/>
58&#160;<br/>
2015-09-25&#160;&#160;2016-08-25&#160;<br/>
0&#160;<br/>
0&#160;<br/>
0&#160;&#160;&#160; &#160; &#160;&#160;<br/>
21.06&#160;<br/>
否&#160;<br/>
黄平利&#160;<br/>
副总经理&#160;<br/>
男&#160;<br/>
57&#160;<br/>
2015-09-25&#160;&#160;2016-08-25&#160;<br/>
0&#160;<br/>
0&#160;<br/>
0&#160;&#160;&#160; &#160; &#160;&#160;<br/>
28.43&#160;<br/>
否&#160;<br/>
胡鑫&#160;<br/>
副总经理&#160;<br/>
男&#160;<br/>
47&#160;<br/>
2015-09-25&#160;&#160;2018-12-30&#160;<br/>
0&#160;<br/>
0&#160;<br/>
0&#160;&#160;&#160; &#160; &#160;&#160;<br/>
36.17&#160;<br/>
否&#160;<br/>
张西慈&#160;<br/>
财务负责人&#160;&#160;男&#160;<br/>
51&#160;<br/>
2015-09-25&#160;&#160;2017-02-10&#160;<br/>
0&#160;<br/>
0&#160;<br/>
0&#160;&#160;&#160; &#160; &#160;&#160;<br/>
28.04&#160;<br/>
否&#160;<br/>
张美清&#160;<br/>
董事会秘书&#160;&#160;女&#160;<br/>
38&#160;<br/>
2011-07-21&#160;&#160;2018-12-30&#160;<br/>
0&#160;<br/>
0&#160;<br/>
0&#160;&#160;&#160; &#160; &#160;&#160;<br/>
13.16&#160;<br/>
否&#160;<br/>
合计&#160;<br/>
/&#160;<br/>
/&#160;<br/>
/&#160;<br/>
/&#160;<br/>
/&#160;<br/>
0&#160;<br/>
0&#160;<br/>
0&#160;<br/>
/&#160;<br/>
276.66&#160;<br/>
/&#160;<br/>
&#160;<br/>
<b>48</b>&#160;/&#160;<b>154</b>&#160;<br/>
&#160;<br/>
<hr/>
<a name=49></a>2016&#160;年年度报告<b>&#160;</b><br/>
姓名&#160;<br/>
主要工作经历&#160;<br/>
高级工商管理硕士，高级经济师。近五年来曾任山东银座商城股份有限公司总经理、董事长，山东省商业集团有限公司副总经理，本公<br/>
张文生&#160;<br/>
司董事长。2017&#160;年&#160;2&#160;月&#160;27&#160;日起，由于工作变动，不再担任本公司职务。&#160;<br/>
王志盛&#160;<br/>
工商管理硕士。近五年来曾任本公司董事、总经理、副总经理。<br/>&#160;<br/>
<b>(</b>二<b>)&#160;</b>董事、高级管理人员报告期内被授予的股权激励情况<b>&#160;<br/></b>□适用√不适用&#160;&#160;<br/>&#160;<br/>
二、现任及报告期内离任董事、监事和高级管理人员的任职情况<b>&#160;</b><br/>
<b>(</b>一<b>)&#160;&#160;</b>在股东单位任职情况<b>&#160;<br/></b>√适用&#160;□不适用&#160;&#160;<br/>
任职人员姓名&#160;<br/>
股东单位名称&#160;<br/>
在股东单位担任的职务&#160;<br/>
任期起始日期&#160;<br/>
任期终止日期&#160;<br/>
张文生&#160;<br/>
山东省商业集团有限公司&#160;<br/>
副总经理&#160;<br/>
2005.07&#160;<br/>
2017.02&#160;<br/>
张建军&#160;<br/>
山东省商业集团有限公司&#160;<br/>
副总经理&#160;<br/>
2015.05&#160;<br/>
&#160;&#160;&#160;<br/>
张建军&#160;<br/>
山东银座商城股份有限公司&#160;<br/>
董事长&#160;<br/>
2013.04&#160;<br/>
&#160;&#160;<br/>
张建军&#160;<br/>
山东银座商城股份有限公司&#160;<br/>
总经理&#160;<br/>
2013.04&#160;<br/>
&#160;&#160;&#160;<br/>
张志军&#160;<br/>
山东银座商城股份有限公司&#160;<br/>
财务部长&#160;<br/>
2015.09&#160;<br/>
&#160;&#160;&#160;<br/>
&#160;<br/>
<b>50</b>&#160;/&#160;<b>154</b>&#160;<br/>
&#160;<br/>
<hr/>
<a name=51></a>2016&#160;年年度报告<b>&#160;</b><br/>
<b>(</b>二<b>)&#160;&#160;</b>在其他单位任职情况<b>&#160;<br/></b>√适用&#160;□不适用&#160;&#160;<br/>
任职人员姓名&#160;<br/>
其他单位名称&#160;<br/>
在其他单位担任的职务&#160;<br/>
任期起始日期&#160;<br/>
任期终止日期&#160;<br/>
张文生&#160;<br/>
山东银座家居有限公司&#160;<br/>
董事长&#160;<br/>
2011.05&#160;<br/>
2017.01&#160;<br/>
张建军&#160;<br/>
山东省商业集团财务有限公司&#160;<br/>
董事长&#160;<br/>
2015.10&#160;<br/>
&#160;&#160;&#160;<br/>
张建军&#160;<br/>
济南市富源小额贷款有限公司&#160;<br/>
董事长&#160;<br/>
2015.12&#160;<br/>
&#160;&#160;&#160;<br/>
&#160;<br/>
三、董事、监事、高级管理人员报酬情况<b>&#160;<br/></b>√适用&#160;□不适用&#160;&#160;<br/>
董事、监事的报酬由公司股东大会审议决定。高级管理人员报酬由公司薪酬与考核委员<br/>
董事、监事、高级管理人员报酬的决策程序&#160;<br/>
会审议后提交董事会决定。&#160;<br/>公司第十一届董事、监事报酬依据&#160;2016&#160;年第一次临时股东大会批准的《关于董、监事<br/>
董事、监事、高级管理人员报酬确定依据&#160;<br/>
津贴的议案》、《关于独立董事报酬的议案》执行。高级管理人员报酬，依据公司董事<br/>会审议批准的《关于公司高级管理人员薪酬的议案》与公司实际经营相结合确定。&#160;<br/>
董事、监事和高级管理人员报酬的实际支付情况&#160;<br/>
详见现任及报告期内离任董事、监事和高级管理人员持股变动及报酬情况表。&#160;<br/>
报告期末全体董事、监事和高级管理人员实际获得的报酬合计&#160;&#160;276.66&#160;万元&#160;<br/>&#160;<br/>
四、公司董事、监事、高级管理人员变动情况<b>&#160;<br/></b>√适用&#160;□不适用&#160;&#160;<br/>
姓名&#160;<br/>
担任的职务&#160;<br/>
变动情形&#160;<br/>
变动原因&#160;<br/>
王成&#160;<br/>
副总经理&#160;<br/>
离任&#160;<br/>
因年龄原因，离岗休养&#160;<br/>
黄平利&#160;<br/>
副总经理&#160;<br/>
离任&#160;<br/>
因年龄原因，离岗休养&#160;<br/>
&#160;<br/>
五、近三年受证券监管机构处罚的情况说明<b>&#160;<br/></b>□适用&#160;√不适用&#160;&#160;<br/>&#160;<br/>
<b>51</b>&#160;/&#160;<b>154</b>&#160;<br/>
&#160;<br/>
<hr/>
<a name=52></a>2016&#160;年年度报告<b>&#160;</b><br/>
&#160;<br/>
六、母公司和主要子公司的员工情况
'''

if __name__ == '__main__':
    unittest.main()
